{
  "0": {
    "ISBN": "1491924136",
    "author": "Matthew Kirk",
    "category": "Data Mining",
    "description": "\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<p>Gain the confidence you need to apply machine learning in your daily work. With this practical guide, author Matthew Kirk shows you how to integrate and test machine learning algorithms in your code, without the academic subtext.</p>\n<p>Featuring graphs and highlighted code examples throughout, the book features tests with Python’s Numpy, Pandas, Scikit-Learn, and SciPy data science libraries. If you’re a software engineer or business analyst interested in data science, this book will help you:</p>\n<ul>\n<li>Reference real-world examples to test each algorithm through engaging, hands-on exercises</li>\n<li>Apply test-driven development (TDD) to write and run tests before you start coding</li>\n<li>Explore techniques for improving your machine-learning models with data extraction and feature development</li>\n<li>Watch out for the risks of machine learning, such as underfitting or overfitting data</li>\n<li>Work with K-Nearest Neighbors, neural networks, clustering, and other algorithms</li>\n</ul>\n\t\t\t\t\t\t\t\t\t\t\t",
    "downloadLink": "http://file.allitebooks.com/20170831/Thoughtful Machine Learning with Python.pdf",
    "fileFormat": "PDF",
    "fileSize": "8.6 MB",
    "imgName": "Thoughtful Machine Learning with Python.jpg",
    "language": "English",
    "pages": "216",
    "readLink": "/read/index.php?id=28047",
    "title": "Thoughtful Machine Learning with Python",
    "year": "2017"
  },
  "1": {
    "ISBN": "1491933666",
    "author": "Eben Hewitt, Jeff Carpenter",
    "category": "Datebases",
    "description": "\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<p>Imagine what you could do if scalability wasn’t a problem. With this hands-on guide, you’ll learn how the Cassandra database management system handles hundreds of terabytes of data while remaining highly available across multiple data centers. This expanded second edition—updated for Cassandra 3.0—provides the technical details and practical examples you need to put this database to work in a production environment.</p>\n<p>Authors Jeff Carpenter and Eben Hewitt demonstrate the advantages of Cassandra’s non-relational design, with special attention to data modeling. If you’re a developer, DBA, or application architect looking to solve a database scaling issue or future-proof your application, this guide helps you harness Cassandra’s speed and flexibility.</p>\n<ul>\n<li>Understand Cassandra’s distributed and decentralized structure</li>\n<li>Use the Cassandra Query Language (CQL) and&nbsp;cqlsh—the CQL shell</li>\n<li>Create a working data model and compare it with an equivalent relational model</li>\n<li>Develop sample applications using client drivers for languages including Java, Python, and Node.js</li>\n<li>Explore cluster topology and learn how nodes exchange data</li>\n<li>Maintain a high level of performance in your cluster</li>\n<li>Deploy Cassandra on site, in the Cloud, or with Docker</li>\n<li>Integrate Cassandra with Spark, Hadoop, Elasticsearch, Solr, and Lucene</li>\n</ul>\n\t\t\t\t\t\t\t\t\t\t\t",
    "downloadLink": "http://file.allitebooks.com/20170901/Cassandra The Definitive Guide, 2nd Edition.pdf",
    "fileFormat": "PDF",
    "fileSize": "7.8 MB",
    "imgName": "Cassandra The Definitive Guide 2nd Edition.jpg",
    "language": "English",
    "pages": "370",
    "readLink": "/read/index.php?id=28050",
    "title": "Cassandra: The Definitive Guide, 2nd Edition",
    "year": "2016"
  },
  "2": {
    "ISBN": "1491943203",
    "author": "Holden Karau, Rachel Warren",
    "category": "Datebases",
    "description": "\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<p>Apache Spark is amazing when everything clicks. But if you haven’t seen the performance improvements you expected, or still don’t feel confident enough to use Spark in production, this practical book is for you. Authors Holden Karau and Rachel Warren demonstrate performance optimizations to help your Spark queries run faster and handle larger data sizes, while using fewer resources.</p>\n<p>Ideal for software engineers, data engineers, developers, and system administrators working with large-scale data applications, this book describes techniques that can reduce data infrastructure costs and developer hours. Not only will you gain a more comprehensive understanding of Spark, you’ll also learn how to make it sing.</p>\n<p>With this book, you’ll explore:</p>\n<ul>\n<li>How Spark SQL’s new interfaces improve performance over SQL’s RDD data structure</li>\n<li>The choice between data joins in Core Spark and Spark SQL</li>\n<li>Techniques for getting the most out of standard RDD transformations</li>\n<li>How to work around performance issues in Spark’s key/value pair paradigm</li>\n<li>Writing high-performance Spark code without Scala or the JVM</li>\n<li>How to test for functionality and performance when applying suggested improvements</li>\n<li>Using Spark MLlib and Spark ML machine learning libraries</li>\n<li>Spark’s Streaming components and external community packages</li>\n</ul>\n\t\t\t\t\t\t\t\t\t\t\t",
    "downloadLink": "http://file.allitebooks.com/20170831/High Performance Spark.pdf",
    "fileFormat": "PDF",
    "fileSize": "7.1 MB",
    "imgName": "High Performance Spark.jpg",
    "language": "English",
    "pages": "358",
    "readLink": "/read/index.php?id=28044",
    "title": "High Performance Spark",
    "year": "2017"
  },
  "3": {
    "ISBN": "111846446X",
    "author": "Eben Upton, Gareth Halfacree",
    "category": "Hardware & DIY",
    "description": "\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<p>Make the most out of the world’s first truly compact computer</p>\n<p>It’s the size of a credit card, it can be charged like a smartphone, it runs on open-source Linux, and it holds the promise of bringing programming and playing to millions at low cost. And now you can learn how to use this amazing computer from its co-creator, Eben Upton, in&nbsp;Raspberry Pi User Guide. Cowritten with Gareth Halfacree, this guide gets you up and running on Raspberry Pi, whether you’re an educator, hacker, hobbyist, or kid. Learn how to connect your Pi to other hardware, install software, write basic programs, and set it up to run robots, multimedia centers, and more.</p>\n<ul>\n<li>Gets you up and running on Raspberry Pi, a high-tech computer the size of a credit card</li>\n<li>Helps educators teach students how to program</li>\n<li>Covers connecting Raspberry Pi to other hardware, such as monitors and keyboards, how to install software, and how to configure Raspberry Pi</li>\n<li>Shows you how to set up Raspberry Pi as a simple productivity computer, write basic programs in Python, connect to servos and sensors, and drive a robot or multimedia center</li>\n</ul>\n<p>Adults, kids, and devoted hardware hackers, now that you’ve got a Raspberry Pi, get the very most out of it with&nbsp;Raspberry Pi User Guide.</p>\n\t\t\t\t\t\t\t\t\t\t\t",
    "downloadLink": "http://file.allitebooks.com/20170830/Raspberry Pi User Guide.pdf",
    "fileFormat": "PDF",
    "fileSize": "27.5 MB",
    "imgName": "Raspberry Pi User Guide.jpg",
    "language": "English",
    "pages": "262",
    "readLink": "/read/index.php?id=28041",
    "title": "Raspberry Pi User Guide",
    "year": "2012"
  },
  "4": {
    "ISBN": "1491954388",
    "author": "Andreas M. Antonopoulos",
    "category": "Security",
    "description": "\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<p>Join the technological revolution that’s taking the world of finance by storm.&nbsp;Mastering Bitcoin&nbsp;is your guide through the seemingly complex world of bitcoin, providing the knowledge you need to participate in the internet of money. Whether you’re building the next killer app, investing in a startup, or simply curious about the technology, this revised and expanded second edition provides essential detail to get you started.<br>\nBitcoin, the first successful decentralized digital currency, is still in its early stages and yet it’s already spawned a multi-billion dollar global economy. This economy is open to anyone with the knowledge and passion to participate.&nbsp;Mastering Bitcoin&nbsp;provides the knowledge. You simply supply the passion.<br>\nThe second edition includes:</p>\n<ul>\n<li>A broad introduction to bitcoin–ideal for non-technical users, investors, and business executives</li>\n<li>An explanation of the technical foundations of bitcoin and cryptographic currencies for developers, engineers, and software and systems architects</li>\n<li>Details of the bitcoin decentralized network, peer-to-peer architecture, transaction lifecycle, and security principles</li>\n<li>New developments such as Segregated Witness, Payment Channels, and Lightning Network</li>\n<li>Improved explanations of keys, addresses and wallets</li>\n<li>User stories, analogies, examples, and code snippets illustrating key technical concepts</li>\n</ul>\n\t\t\t\t\t\t\t\t\t\t\t",
    "downloadLink": "http://file.allitebooks.com/20170829/Mastering Bitcoin, 2nd Edition.pdf",
    "fileFormat": "PDF",
    "fileSize": "11.5 MB",
    "imgName": "Mastering Bitcoin 2nd Edition.jpg",
    "language": "English",
    "pages": "408",
    "readLink": "/read/index.php?id=28038",
    "title": "Mastering Bitcoin, 2nd Edition",
    "year": "2017"
  },
  "5": {
    "ISBN": "1119150795",
    "author": "Christine Bresnahan, Richard Blum",
    "category": "Linux",
    "description": "\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<p>Full coverage of the latest LPI-level 2 exams, with bonus online test bank</p>\n<p>LPIC-2&nbsp;is the one-stop preparation resource for the Linux Professional Institute’s Advanced Level certification exam. With 100 percent coverage of all exam objectives, this book provides clear and concise coverage of the Linux administration topics you’ll need to know for exams 201 and 202. Practical examples highlight the real-world applications of important concepts, and together, the author team provides insights based on almost fifty years in the IT industry. This brand new second edition has been completely revamped to align with the latest versions of the exams, with authoritative coverage of the Linux kernel, system startup, advanced storage, network configuration, system maintenance, web services, security, troubleshooting, and more. You also get access to online learning tools including electronic flashcards, chapter tests, practice exams, and a glossary of critical terms to help you solidify your understanding of upper-level Linux administration topics.</p>\n<p>The LPI-level 2 certification confirms your advanced Linux skill set, and the demand for qualified professionals continues to grow. This book gives you the conceptual guidance and hands-on practice you need to pass the exam with flying colors.</p>\n<ul>\n<li>Understand&nbsp;all&nbsp;of the material for&nbsp;both&nbsp;LPIC-2 exams</li>\n<li>Gain insight into real-world applications</li>\n<li>Test your knowledge with chapter tests and practice exams</li>\n<li>Access online study aids for more thorough preparation</li>\n</ul>\n<p>Organizations are flocking to the open-source Linux as an excellent, low-cost, secure alternative to expensive operating systems like Microsoft Windows. As the Linux market share continues to climb, organizations are scrambling to find network and server administrators with expert Linux knowledge and highly practical skills. The LPI-level 2 certification makes you the professional they need, and&nbsp;LPIC-2&nbsp;is your ideal guide to getting there.</p>\n\t\t\t\t\t\t\t\t\t\t\t",
    "downloadLink": "http://file.allitebooks.com/20170829/PIC-2 Linux Professional Institute Certification Study Guide, 2nd Edition.pdf",
    "fileFormat": "PDF",
    "fileSize": "14.8 MB",
    "imgName": "PIC 2 Linux Professional Institute Certification Study Guide 2nd Edition.jpg",
    "language": "English",
    "pages": "768",
    "readLink": "/read/index.php?id=28035",
    "title": "PIC-2: Linux Professional Institute Certification Study Guide, 2nd Edition",
    "year": "2016"
  },
  "6": {
    "ISBN": "1785880543",
    "author": "Antonio Lopez",
    "category": "PHP",
    "description": "\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<p>PHP is a great language for building web applications. It is essentially a server-side scripting language that is also used for general purpose programming. PHP 7 is the latest version with a host of new features, and it provides major backwards-compatibility breaks.</p>\n<p>This book begins with the fundamentals of PHP programming by covering the basic concepts such as variables, functions, class, and objects. You will set up PHP server on your machine and learn to read and write procedural PHP code. After getting an understanding of OOP as a paradigm, you will execute MySQL queries on your database. Moving on, you will find out how to use MVC to create applications from scratch and add tests. Then, you will build REST APIs and perform behavioral tests on your applications.</p>\n<p>By the end of the book, you will have the skills required to read and write files, debug, test, and work with MySQL.</p>\n<p>What you will learn</p>\n<ul>\n<li>Set up a server on your machine with PHP</li>\n<li>Use PHP syntax with the built-in server to create apps</li>\n<li>Apply the OOP paradigm to PHP to write richer code</li>\n<li>Use MySQL to manage data in your web applications</li>\n<li>Create a web application from scratch using MVC</li>\n<li>Add tests to your web application and write testable code</li>\n<li>Use an existing PHP framework to build and manage your applications</li>\n<li>Build REST APIs for your PHP applications</li>\n<li>Test the behavior of web applications with Behat</li>\n</ul>\n\t\t\t\t\t\t\t\t\t\t\t",
    "downloadLink": "http://file.allitebooks.com/20170827/Learning PHP 7.pdf",
    "fileFormat": "PDF",
    "fileSize": "5.8 MB",
    "imgName": "Learning PHP 7 400x493.jpg",
    "language": "English",
    "pages": "414",
    "readLink": "/read/index.php?id=28029",
    "title": "Learning PHP 7",
    "year": "2016"
  },
  "7": {
    "ISBN": "1119278635",
    "author": "Adam Gordon, Steven Hernandez",
    "category": "Network Security",
    "description": "\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<p>The fourth edition of the&nbsp;Official (ISC)<sup>2</sup>® Guide to the SSCP&nbsp;CBK®&nbsp;is a comprehensive resource providing an in-depth look at the seven domains of the SSCP Common Body of Knowledge (CBK).&nbsp; This latest edition provides an updated, detailed guide that is considered one of the best tools for candidates striving to become an SSCP.</p>\n<p>The book offers step-by-step guidance through each of SSCP’s domains, including best practices and techniques used by the world’s most experienced practitioners. Endorsed by (ISC)² and compiled and reviewed by SSCPs and subject matter experts, this book brings together a global, thorough perspective to not only prepare for the SSCP exam, but it also provides a reference that will serve you well into your career.</p>\n\t\t\t\t\t\t\t\t\t\t\t",
    "downloadLink": "http://file.allitebooks.com/20170828/The Official (ISC)2 Guide to the SSCP CBK, 4th Edition.pdf",
    "fileFormat": "PDF",
    "fileSize": "86.2 MB",
    "imgName": "The Official ISC2 Guide to the SSCP CBK 4th Edition.jpg",
    "language": "English",
    "pages": "928",
    "readLink": "/read/index.php?id=28032",
    "title": "The Official (ISC)2 Guide to the SSCP CBK, 4th Edition",
    "year": "2016"
  },
  "8": {
    "ISBN": "1484227743",
    "author": "Bryan WC Chung",
    "category": "Programming",
    "description": "\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<div>Apply the Processing language to tasks involved in computer vision–tasks such as edge and corner detection, recognition of motion between frames in a video, recognition of objects, matching of feature points and shapes in different frames for tracking purposes, and more. You will manipulate images through creative effects, geometric transformation, blending of multiple images, and so forth. Examples are provided.</div>\n<div></div>\n<div>Pro Processing for Images and Computer Vision with OpenCV&nbsp;is a step-by-step training tool that guides you through a series of worked examples in linear order. Each chapter begins with a basic demonstration, including the code to recreate it on your own system. Then comes a creative challenge by which to engage and develop mastery of the chapter’s topic. The book also includes hints and tips relating to visual arts, interaction design, and industrial best practices.</div>\n<div></div>\n<div>This book is intended for any developer of artistic and otherwise visual applications, such as in augmented reality and digital effects, with a need to manipulate images, and to recognize and manipulate objects within those images. The book is specifically targeted at those making use of the Processing language that is common in artistic fields, and to Java programmers because of Processing’s easy integration into the Java programming environment.</div>\n<div></div>\n<div>What You’ll Learn</div>\n<div>\n<div>\n<ul>\n<li>Make use of OpenCV, the open source library for computer vision in the Processing environment</li>\n<li>Capture live video streams and examine them frame-by-frame for objects in motion</li>\n<li>Recognize shapes and objects through techniques of detecting lines, edges, corners, and more</li>\n<li>Transform images by scaling, translating, rotating, and additionally through various distortion effects</li>\n<li>Apply techniques such as background subtraction to isolate motion of objects in live video streams</li>\n<li>Detect and track human faces and other objects by matching feature points in different images or video frames</li>\n</ul>\n</div>\n<div></div>\n</div>\n<div>Who This Book Is For</div>\n<div></div>\n<div>Media artists, designers, and creative coders</div>\n\t\t\t\t\t\t\t\t\t\t\t",
    "downloadLink": "http://file.allitebooks.com/20170827/Pro Processing for Images and Computer Vision with OpenCV.pdf",
    "fileFormat": "PDF",
    "fileSize": "11.6 MB",
    "imgName": "Pro Processing for Images and Computer Vision with OpenCV.jpg",
    "language": "English",
    "pages": "292",
    "readLink": "/read/index.php?id=28026",
    "title": "Pro Processing for Images and Computer Vision with OpenCV",
    "year": "2017"
  },
  "9": {
    "ISBN": "1484229991",
    "author": "Nathan Haines",
    "category": "Operating Systems",
    "description": "\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<p>Discover how to get the most out of Ubuntu for work, home, and play. &nbsp;Learning a new operating system can feel daunting, especially if you’re used to Windows or OS X. If you’ve been afraid to try Ubuntu because you don’t know where to start, this book introduces you to a wide selection of software and settings that will make your computer ready to work for you.</p>\n<div>You’ll see how Ubuntu can make your computing life easy. In addition to a tour of Ubuntu’s modern and easy-to-use interface, you’ll also learn how Ubuntu’s Software Updater keeps all of your software secure and up-to-date. Browsing the Internet becomes faster and safer. Creating documents and sharing with others is built right in. Enjoying your music and movie libraries helps you unwind.<p></p>\n</div>\n<div></div>\n<div>Ubuntu is the world’s third most popular operating system and powers desktop and laptop computers, servers, private and public clouds, and embedded devices. There’s never been a better time to install Ubuntu and move to an open source way of life. Completely updated for this exciting second edition,&nbsp;Beginning Ubuntu for Windows and Mac Users&nbsp;will help you start your journey into Free and Open Source Software with Ubuntu 16.04 LTS.<p></p>\n</div>\n<div></div>\n<div>What You’ll Learn<p></p>\n</div>\n<div>\n<ul>\n<li>Understand the advantages of Ubuntu and its variants―Kubuntu, Xubuntu, and more</li>\n<li>Install Ubuntu on its own or alongside your computer’s existing operating system</li>\n<li>Search Ubuntu’s catalog of thousands of applications―all ready to install with a single click</li>\n<li>Work with files and disks that were created with Windows and OS X</li>\n<li>Run simple, interesting tasks and games using the command line</li>\n<li>Customize Ubuntu in powerful ways and get work done with virtual machines</li>\n</ul>\n<div>Who This Book Is For<p></p>\n</div>\n</div>\n<div>\n<p>Anyone who wants to move to using an open source operating system.</p>\n</div>\n\t\t\t\t\t\t\t\t\t\t\t",
    "downloadLink": "http://file.allitebooks.com/20170826/Beginning Ubuntu for Windows and Mac Users, 2nd Edition.pdf",
    "fileFormat": "PDF",
    "fileSize": "11.9 MB",
    "imgName": "Beginning Ubuntu for Windows and Mac Users.jpg",
    "language": "English",
    "pages": "196",
    "readLink": "/read/index.php?id=28022",
    "title": "Beginning Ubuntu for Windows and Mac Users, 2nd Edition",
    "year": "2017"
  }
}